MusicApp/app/controllers/application_controller.rb

  def set_current_user
    if session[:session_token].nil?
      @current_user = nil
    else
      @current_user = User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "JO_mB3SbiTjfSUN0aji2qQ"], ["LIMIT", 1]]