MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]
---
  def create
    @current_user = User.new(email: @user_params[:email], password: @user_params[:new_password]).set_token
    flash[:errors] << "Passwords Do Not Match" unless @current_user.is_password?(@user_params[:validate_new_password])

    if @current_user.valid? && flash[:errors].none?
      login!
      flash[:notices] << "User Was Successfully Created"