MusicApp/app/models/user.rb

  def self.validate_login(email, password)
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "testing123"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1swd5SnqTuBrcR_qh5FP-Q"], ["updated_at", "2018-11-15 21:33:05.913211"], ["id", 15]]